---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LoadIsConstrainedOnHost
source: html/77519bc4-1d81-9bc4-f601-6ad6afd6fa3b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LoadIsConstrainedOnHost Property

"Is constrained on host"

## Syntax (C#)
```csharp
public static ForgeTypeId LoadIsConstrainedOnHost { get; }
```